In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'],
                    'rank': range(1, 4)})

df2 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'],
                    'rank': [1, 4, 5]})

In [3]:
df1

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

In [4]:
df2

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

# 子查询

In [ ]:
'''

select *

from df1 t1

where t1.city in (select t2.city from df2 t2)

'''

In [ ]:
# 1.isin 后为 Series

In [5]:
df1

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

In [6]:
df2

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

In [7]:
df1.loc[df1.city.isin(df2.city)]

      city  rank
0  Chicago     1

In [12]:
# 2.isin 后 为 list

In [16]:
# df1 City为 Chicago 与 New York City

In [9]:
df1.loc[df1.city.isin(['Chicago','New York City'])]

            city  rank
0        Chicago     1
2  New York City     3

In [ ]:
#  扩展 ： isin 后为 DataFrame 需要 列名、索引、值一致时，才会显示结果

In [12]:
df1[df1.isin(df2)]

      city  rank
0  Chicago   1.0
1      NaN   NaN
2      NaN   NaN

# 数据更新

In [14]:
tip = pd.read_csv('tips.csv').head()

tip

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
'''
UPDATE tips
SET tip = tip*2
WHERE tip < 2;

'''

In [ ]:
# *=2

In [17]:
tip.loc[tip.tip < 2,'tip'] *= 2

In [18]:
tip

   total_bill   tip     sex smoker  day    time  size
0       16.99  2.02  Female     No  Sun  Dinner     2
1       10.34  3.32    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
'''
DELETE FROM tips
WHERE tip > 3.5;

'''

In [21]:
tip = tip.loc[tip.tip <= 3.5]

In [22]:
tip

   total_bill   tip     sex smoker  day    time  size
0       16.99  2.02  Female     No  Sun  Dinner     2
1       10.34  3.32    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2